app/controllers/admins_controller.rb

  def index
	@bookings = CaravanCustomersFacility.all
---
SELECT * FROM `caravan_customers_facilities`

  def create
    logout_keeping_session!
    @admin = Admin.new(params[:admin])

    success = @admin && @admin.save
---
INSERT INTO `admins` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', 'a6fbaba6ceefab62639b062f935140779f7c2ddf', '2010-05-07 23:25:33', '694b20982b10ffa1d5a87d4817c7110f7f06991d', NULL, '2010-05-07 23:25:33', NULL, 'myowin76', 'myowin76@gmail.com')