app/controllers/caravan_customers_controller.rb

SELECT * FROM `caravan_customers`
SELECT * FROM `caravans`
---
  def index
	@customer = Customer.find(params[:customer_id])
	@caravan = Caravan.find(params[:caravan_id])
    @caravan_customers = @caravan.caravan_customers.all

SELECT * FROM `caravans` WHERE (`caravans`.`id` = 1)
SELECT * FROM `caravan_customers` WHERE (`caravan_customers`.`id` = 0 AND (`caravan_customers`.caravan_id = 1))
---
  def show
	@caravan = Caravan.find(params[:caravan_id])
    @caravan_customers = @caravan.caravan_customers.find(params[:id])

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
SELECT * FROM `caravans` WHERE (`caravans`.`id` = 0)
SELECT * FROM `facilities`
---
  def new
	@customer = Customer.find(params[:customer_id])
	@caravan = Caravan.find(params[:caravan_id])
	@facilities = Facility.all

SELECT * FROM `caravans` WHERE (`caravans`.`id` = 1)
INSERT INTO `caravan_customers` (`no_of_children`, `arrival_date`, `created_at`, `updated_at`, `week_no`, `deposit_paid`, `no_of_adults`, `caravan_id`, `location_id`, `departure_date`, `customer_id`, `status`) VALUES(1, '2010-04-22', '2010-04-22 23:59:23', '2010-04-22 23:59:23', NULL, 200, 4, NULL, NULL, '2010-04-27', NULL, NULL)
---
  def create
	@caravan = Caravan.find(params[:caravan_id])
	#@caravan_customer.customer = params[:customer][:id]
    @caravan_customer = @caravan.caravan_customers.build(params[:caravan_customer])
	#@caravan_customer.customer_id = @customer_id
	#checked_c_facilities = get_c_facilities_from(params[:caravan_facilities_list])
	#removed_c_facilities = @facilities - checked_c_facilities



    if @caravan_customer.save

SELECT * FROM `caravan_customers` WHERE (`caravan_customers`.`id` = 1)
---
  def edit
    @caravan_customer = @caravan.caravan_customers.find(params[:id])