app/controllers/caravans_controller.rb

	def index
		@customer_id = params[:customer_id]
		@caravans = Caravan.all

		if @customer_id
			@customers = Customer.find(@customer_id)
---
SELECT * FROM `caravans`
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)

  def show
    @caravan = Caravan.find(params[:id])
---
SELECT * FROM `caravans` WHERE (`caravans`.`id` = 0)

  def create
    @caravan = Caravan.new(params[:caravan])

    if @caravan.save
---
INSERT INTO `caravans` (`price`, `caravan_type_id`, `created_at`, `pitch_no`, `build_date`, `updated_at`, `owner_id`, `status`) VALUES(NULL, NULL, '2010-04-22 21:27:35', NULL, NULL, '2010-04-22 21:27:35', NULL, NULL)

  def edit
    @caravan = Caravan.find(params[:id])
---
SELECT * FROM `caravans` WHERE (`caravans`.`id` = 4)

  def destroy
    @caravan = Caravan.find(params[:id])
    @caravan.destroy
---
SELECT * FROM `caravans` WHERE (`caravans`.`id` = 4)
DELETE FROM `caravans` WHERE `id` = 4