app/controllers/caravan_types_controller.rb

  def index
    @caravan_types = CaravanType.all
---
SELECT * FROM `caravan_types`