app/controllers/caravan_facilities_controller.rb

  def index
    @caravan_facilities = CaravanFacility.all
---
SELECT * FROM `caravan_facilities`