app/controllers/charges_controller.rb

SELECT * FROM `charges`
---
  def index
    @charges = Charge.all