app/controllers/customers_controller.rb

  def index
    #@customers = Customer.all
	@customers = Customer.search(params[:search])
---
SELECT * FROM `customers` WHERE (lastname LIKE '%a%')

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)

  def create
    @customer = Customer.new(params[:customer])
    if @customer.save
---
INSERT INTO `customers` (`address1`, `address2`, `created_at`, `title`, `updated_at`, `lastname`, `firstname`, `phone`, `email`) VALUES('9, Ashford Court', 'London', '2010-04-22 15:21:36', 'Mr', '2010-04-22 15:21:36', 'Win', 'Aung', '3939393', 'myowin76@gmail.com')

  def edit
    @customer = Customer.find(params[:id])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 6)
DELETE FROM `customers` WHERE `id` = 6