app/controllers/facilities_controller.rb

SELECT * FROM `facilities`
---
  def index
    @facilities = Facility.all

SELECT * FROM `facilities` WHERE (`facilities`.`id` = 1)
---
  def show
    @facility = Facility.find(params[:id])

SELECT * FROM `facilities` WHERE (`facilities`.`id` = 1)
---
  def edit
    @facility = Facility.find(params[:id])