app/controllers/owners_controller.rb

  def index
    @owners = Owner.all
---
SELECT * FROM `owners`